{ "_id" : { "$oid" : "596e04dfed53b63c5cd11c61" }, "updatedAt" : { "$date" : "2017-07-18T14:53:51.556+0200" }, "createdAt" : { "$date" : "2017-07-18T14:53:51.556+0200" }, "title" : "Exercice 1", "content" : "Qu’est ce qu'un fork Github ?\nUn fork est une copie de dépôt, qui nous donne une permission d'écriture sur celui-ci.\n\nA quoi sert-il ?\nIl sert à effectuer des modifications sur un dépôt ou utiliser le projet d'une autre personne.\n\nQu’est-ce qu’une pull request ? Quel est l’intérêt ?\nElle sert à proposer les modifications effectuées à l'auteur du dépôt.\nDe cette façon, l'auteur est libre ou non des les accepter.\n\nQu’est-ce qu’une branche ?\nLa branche facilite le travail en groupe, elle permet de travailler sur un projet en évitant d'impacter la branche principale.\n\nQuelle est la différence entre une branche et un fork ? \nun fork est une copie de dépôt, la branche est créée dans un dépôt déjà existant.", "__v" : 0 }
{ "_id" : { "$oid" : "596e0f77ed53b63c5cd11c62" }, "updatedAt" : { "$date" : "2017-07-18T15:39:03.764+0200" }, "createdAt" : { "$date" : "2017-07-18T15:39:03.764+0200" }, "title" : "La MEAN stack", "content" : "Angular\nC'est un framework JavaScript, qui va dynamiser le HTML et permettre de créer une application.\nIl est utilisé côté front et est indispensable pour ce projet.\n\nAngular UI Router\nIl permet de réaliser le routage d'une application. \nLa navigation est semblable à celle d'un site classique, sans rechargement de pages.\nOui c'est indispensable pour la réalisation de ce projet.\n\nExpress\nC'est un petit framework pour Node js qui permet d'être plus rapide dans la création d'applications.\nIl s'utilise côté back.\n\nJSONWebToken\nIl permet de gérer l'authentification de manière sécurisée.\ncôté back.\n\nMongoose\nC'est une système de base de données, il s'utilise côté back et est indispensable au projet.\n\nMaterializeCSS\nC'est un framework CSS, il s'utilise côté front et back.\nUn autre framework comme bootstrap ou Tachyons aurait pu être utilisé pour ce projet.\n\nPassport\nPermet de gérer l'authentification.\ncôté back.\n\nBabel\nIl permet de bénéficier des modules ES6 dans une application Angular.\nIndispensable.\nFront/Back\n\nSCSS\nC'est un langage de feuille de style en cascade.\n\nNodemon\nIl permet de lancer l'application et redémarre automatiquement le serveur en fonction des modifications.\nPas indispensable mais pratique. Côté back et front.\n\nWebpack\nIl permet d'organiser une application en module. C'est un gain de temps considérable!\n\nLivereload\nIl permet de rafraîchir automatiquement les onglets dans le navigateur.\n\nAlors la MEAN stack qu'est ce que c'est?!\n C'est une plateforme fullstack JavaScript pour les applications web, orientée serveur et client", "__v" : 0 }
{ "_id" : { "$oid" : "596e2964ed53b63c5cd11c63" }, "updatedAt" : { "$date" : "2017-07-18T17:29:40.353+0200" }, "createdAt" : { "$date" : "2017-07-18T17:29:40.353+0200" }, "content" : "Que sont les méthodes agiles ? \nCe sont des méthodes itératives et collaborative qui prennent en compte les besoins initiaux du client tout en s'adaptant à l'évolution de ceux ci au long du projet.\n\nQu’est-ce que SCRUM ? \nC'est une méthode Agile dédiée à la gestion de projet.\n\nDéfinir le Product BackLog, de quoi est-il constitué ? \nC'est le cahier des charges initial contenant les exigences hiérarchisées du client sur le projet, susceptibles d'évoluer.\n\nDéfinir le Product Owner\nIl communique avec le client, il gère le backlog, il est le chef de projet.\n\nDéfinir le SCRUM Master\nIl facilite la communication au sein de l'équipe, tend à améliorer la production.\nIl aide l'équipe à travailler de façon autonome.\n\nDéfinir la « Development team »\nElle est dépourvue de hiérarchie interne, elle est auto organisée. Chacun a son rôle dans l'accomplissement des tâches.\n\nDéfinir le Sprint, de quoi est-il constitué ? \nEn début de sprint, l'équipe défini un but et se reparti les tâches.\n\nDéfinir le daily scrum\nIl permet de vérifier l'avancement du travail et de résoudre les erreurs.\n\nQu’est-ce que la planification d’un sprint ? \nC'est une réunion de planification qui sélectionne les exigences les plus urgentes pour le client. Elles seront développées, testées et livrées au client à la fin du sprint.\n\nQu’est-ce que la révision d’un sprint ?\nToute l'équipe participe à celle-ci, elle permet de voir l'avancement du projet, les problèmes rencontrés et les solutions à apporter.\n\n\nQu’est-ce que la rétrospective d’un sprint ? \nLors de la rétrospective, le but est d'identifier ce qui s'est bien déroulé et ce qui s'est mal passé.\nElle permet également de résoudre les problèmes rencontrés.\n\nPourquoi est-il important de définir la notion de « Done » pour les tâches ?\nAfin de se rendre compte de l'avancement de ses réalisations.\n\nLa notion de « Done » peut-elle évoluer au cours d’un projet SCRUM ? \nOui elle le peut en fonction de l'évolution des besoins du client.\n\nSCRUM est-elle une méthodologie itérative ?\nOui car les méthodes utilisées sont essentiellement basées sur la répétition.", "title" : "La méthode Agile SCRUM", "__v" : 0 }
